{
  "basics": {
    "name": "Caleb Atwood",
    "label": "Software Developer",
    "picture": "https://avatars0.githubusercontent.com/u/7191591?v=4&s=400&u=9f3db132271661f1edaa67ae34e79d7df4cc04f9",
    "email": "calebatwd@gmail.com",
    "phone": "(307) 262-8579",
    "website": "https://calebatwd.com",
    "summary": "Full stack software developer looking for a platform or services developer role. My professional projects to date have primarily consisted of scaled backend services, database design, and web frontends for Xbox Live. Before that, I co-founded MyFit Inc, a computer vision startup which received angel funding and placement in one of the Bay Area tech accelerators. Outside of work, my personal projects span a broad range of topics... mobile react apps, crowd-sourced ecommerce sites, computer vision algorithms, 3D reconstruction applications, game development, drone construction, home-security hardware design, and several music projects.",
    "location": {
      "address": "2400 4th Ave Apt 305",
      "postalCode": "WA 98121",
      "city": "Seattle",
      "countryCode": "US",
      "region": "Washington"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "calebatwd",
        "url": "https://www.linkedin.com/in/calebatwd/"
      },
      {
        "network": "GitHub",
        "username": "calebatwd",
        "url": "https://github.com/calebatwd"
      },
      {
        "network": "Facebook",
        "username": "caleb.atwood",
        "url": "https://www.facebook.com/caleb.atwood"
      },
      {
        "network": "Personal",
        "username": "",
        "url": "http://calebatwd.com"
      }
    ]
  },
  "work": [
    {
      "company": "Microsoft",
      "position": "Software Development Engineer 2",
      "website": "",
      "startDate": "2012",
      "endDate": "present",
      "summary": "Service platform engineer on Xbox Live, the collection of services that comprise Xbox's social graph, catalog, content distribution, and multiplayer.",
      "highlights": [
        "Managed a small team in architecting and implementing Game Modes, a real-time configuration service for describing custom gameplay options for multiplayer titles.",
        "Designed and delivered a content and catalog management system for enabling user generated content, currently used in Minecraft's custom content store.",
        "Primary dev on Xbox Developer Portal. Catalog, media ingestion, and frontend features.",
        "Designed, implemented, and filed a patent on an innovative solution for remotely enabling devkit capabilities on retail Xbox devices. See Patents.",
        "Lead an initiative to integrate the Xbox publishing backend with the Windows Dev Center frontend to enable large game binary encryption workflows in the Windows Dev Center"
      ]
    },
    {
      "company": "MyFit Inc.",
      "position": "Co-Founder and Lead Developer",
      "website": "",
      "startDate": "2011",
      "endDate": "2012",
      "summary": "Integrated the Microsoft Kinect, cutting edge 3D computer vision algorithms, and a completely novel 3D in-browser experience in order to change the way consumers shop for clothes online.",
      "highlights": [
        "In charge of system architecture design, task lead, back-end and front-end development, 2D and 3D computer vision implementation, and product design.",
        "Oversaw team of 3 engineers spanning research, graphics, and platform development.",
        "Won Plug and Play Fall EXPO, a Sunnyvale tech accelerator."
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "University of Notre Dame",
      "area": "Electrical Engineering",
      "studyType": "BS",
      "startDate": "2008",
      "endDate": "2012",
      "gpa": "",
      "courses": []
    }
  ],
  "awards": [
    {
      "title": "Converting a Retail Gaming Device Into A Development Kit Remotely",
      "date": "2017-6-16",
      "awarder": "Filing with USPTO",
      "summary": "Designed a device management service to grant runtime certificates to consoles on boot, facilitates the activation of development capabilities."
    },
    {
      "title": "Method and System for Creating a Virtual Avatar for Fitting Clothing",
      "date": "2012-9-28",
      "awarder": "Filed with USPTO",
      "summary": "13/631,572 Inventor on a new method for uploading and processing 3 dimensional point cloud scans of the human body to simulate clothing physics on the reconstructed mesh."
    }
  ],
  "publications": [
    {
      "name": "Festival",
      "publisher": "",
      "releaseDate": "",
      "website": "",
      "summary": "A React-Native + Redux IOS application built with Firebase for sharing geo-localized conversations and content at music festivals."
    },
    {
      "name": "BlockCraft Go",
      "publisher": "",
      "releaseDate": "",
      "website": "",
      "summary": "An AR mobile game based on Pokemon Go, with procedurally generated terrain and structures that resemble those from the game Minecraft. Built with Unity, Google Places, and MapZen."
    },
    {
      "name": "More Games",
      "publisher": "",
      "releaseDate": "",
      "website": "",
      "summary": "Sky Vanguard (3D muliplayer cannon shooter), NDMatchMe (javascript college dating game), Marble Deep (3D multiplayer virtual chat space), Tanks (mobile arcade jumper), Rogue Rider (isometric wasteland driver)."
    }
    ,
    {
      "name": "Other Projects",
      "publisher": "",
      "releaseDate": "",
      "website": "",
      "summary": "Ann Arbor Book Barter (open university book exchange), NDTees (college t-shirt marketplace), Facial Iterative Closest Point (biometric recognition), Magic The Recognition (automated card scanner), Norca (drummer of live performance group)."
    }
  ],
  "skills": [
    {
      "name": "Backend Services",
      "level": "Master",
      "keywords": [
        "C# .NET",
        "SQL",
        "Azure Storage",
        "Document Store",
        "CDN",
        "Entity Framework",
        "REST"
      ]
    },
    {
      "name": "Web Development",
      "level": "Proficient",
      "keywords": [
        "Javascript",
        "ASP.NET",
        "Angular",
        "React",
        "Firebase"
      ]
    },
    {
      "name": "Graphics and Processing",
      "level": "Proficient",
      "keywords": [
        "Unity",
        "OpenGL",
        "OpenCv",
        "Point Cloud Library",
        "C++"
      ]
    }
  ],
  "languages": [],
  "interests": [
    {
      "name": "Tech",
      "keywords": [
        "Augmented Reality",
        "Node",
        "React-Native",
        "Redux",
        "Autonomous Flight",
        "Firestore"
      ]
    },
    {
      "name": "Music",
      "keywords": [
        "Drumming",
        "Guitar",
        "Live Performance"
      ]
    }
  ],
  "references": []
}